#include "LevelOriginAndAutor.h"

// 在 cpp 文件中定义并初始化静态成员
const QVector<QString> LevelOriginAndAutor::targetText = {
    "\n\n  清风徐来，\n  水波不兴。\n\n    《赤壁赋》\n         苏轼",  //
    "\n\n  锲而不舍，\n  金石可镂。\n\n       《劝学》\n         荀子",  // 荀子 劝学
    "\n\n  桃李不言，\n  下自成蹊。\n\n《一剪梅·游蒋山呈叶丞相》\n          辛弃疾", // 一剪梅-游蒋山呈叶丞相 辛弃疾
    "\n\n  明明如月，\n  何时可掇。\n\n    《短歌行》\n         曹操",  //
    "\n\n此时相望不相闻，\n愿逐月华流照君。\n\n   《春江花月夜》\n         张若虚",  // 春江花月夜 张若虚
    "\n\n何须浅碧深红色，\n自是花中第一流。\n\n 《鹧鸪天·桂花》\n          李清照",  // 李清照 鹧鸪天-桂花
    "\n\n江山如此多娇，\n引无数英雄竞折腰。\n\n   《沁园春·雪》\n          毛泽东",  // 沁园春-雪 毛泽东
    "\n\n云想衣裳花想容，\n春风拂槛露华浓。\n\n 《清平调·其一》\n           李白",  // 清平调-其一 李白
    "\n\n纤云弄巧，\n飞星传恨，\n银汉迢迢暗渡。\n\n《鹊桥仙·纤云弄巧》\n           秦观",  // 鹊桥仙-纤云弄巧 秦观
    "\n\n吾充吾爱汝之心，\n助天下人爱其所爱，\n......\n\n      《与妻书》\n          林觉民",  // 与妻书 林觉民
    "\n\n君不见沙场征战苦，\n至今犹忆李将军。\n\n      《燕歌行》\n           高适",  // 燕歌行 高适
    "\n\n剑阁峥嵘而崔嵬，\n一夫当关，\n万夫莫开。\n\n      《蜀道难》\n          李白",  // 李白 蜀道难
    "\n\n今子有五石之瓠，\n何不虑以为大樽\n而浮乎江湖，\n......\n\n    《五石之瓠》\n          庄子", // 庄子 五石之瓠
    "\n\n使秦复爱六国之人，\n则递三世可至万世而\n为君，\n......\n\n      《阿房宫赋》\n            杜牧",  // 阿房宫赋 杜牧
    "\n\n浮长川而忘返，\n思绵绵而增慕，\n夜耿耿而不寐，\n沾繁霜而至曙。\n\n      《洛神赋》\n           曹植",  // 洛神赋 曹植
    "\n\n蒹葭苍苍，白露为霜，\n所谓伊人，在水一方。\n溯洄从之，道阻且长。\n\n    《诗经·蒹葭》",  // 诗经-蒹葭
    "\n\n日星隐曜，山岳潜形，\n商旅不行，樯倾楫摧，\n薄暮冥冥，虎啸猿啼。\n\n      《岳阳楼记》 \n           范仲淹",  // 岳阳楼记 范仲淹
    "\n太上有立德，\n其次有立功，\n其次有立言，\n虽久不废，\n此之谓不朽。\n\n《左传·襄公二十四年》\n           左丘明  ",  // 左传·襄公二十四年
    "\n浔阳江头夜送客，\n枫叶荻花秋瑟瑟。\n主人下马客在船，\n举酒欲饮无管弦。\n醉不成欢惨将别，\n......\n\n       《琵琶行》\n          白居易",  // 琵琶行 白居易
    "\n黄埃散漫风萧索，\n云栈萦纡登剑阁。\n峨嵋山下少人行，\n旌旗无光日色薄。\n蜀江水碧蜀山青，\n......\n\n       《长恨歌》\n          白居易"   // 长恨歌 白居易      ·
};

QString LevelOriginAndAutor::getTargetText(int index) {
    return targetText.value(index, QString());
}

