#include "LevelOriginAndAutor.h"

// 在 cpp 文件中定义并初始化静态成员
const QVector<QString> LevelOriginAndAutor::targetText = {
    "我有嘉宾，鼓瑟吹笙。",  // 短歌行 曹操
    "锲而不舍，金石可镂。",  // 荀子 劝学
    "桃李不言，下自成蹊。",  // 一剪梅-游蒋山呈叶丞相 辛弃疾
    "清风徐来，水波不兴。",  // 苏轼 赤壁赋
    "此时相望不相闻，愿逐月华流照君。",  // 春江花月夜 张若虚
    "何须浅碧深红色，自是花中第一流。",  // 李清照 鹧鸪天-桂花
    "江山如此多娇，引无数英雄竞折腰。",  // 沁园春-雪 毛泽东
    "云想衣裳花想容，春风拂槛露华浓。",  // 清平调-其一 李白
    "纤云弄巧，飞星传恨，银汉迢迢暗渡。",  // 鹊桥仙-纤云弄巧 秦观
    "吾充吾爱汝之心，助天下人爱其所爱，......",  // 与妻书 林觉民
    "君不见沙场征战苦，至今犹忆李将军。",  // 燕歌行 高适
    "剑阁峥嵘而崔嵬，一夫当关，万夫莫开。",  // 李白 蜀道难
    "今子有五石之瓠，何不虑以为大樽而浮乎江湖，......", // 庄子 五石之瓠
    "使秦复爱六国之人，则递三世可至万世而为君，......",  // 阿房宫赋 杜牧
    "浮长川而忘返，思绵绵而增慕，夜耿耿而不寐，沾繁霜而至曙。",  // 洛神赋 曹植
    "蒹葭苍苍，白露为霜，所谓伊人，在水一方。溯洄从之，道阻且长。",  // 诗经-蒹葭
    "日星隐曜，山岳潜形，商旅不行，樯倾楫摧，薄暮冥冥，虎啸猿啼。",  // 岳阳楼记 范仲淹
    "太上有立德，其次有立功，其次有立言，虽久不废，此之谓不朽。",  // 左传▪襄公二十四年
    "浔阳江头夜送客，枫叶荻花秋瑟瑟。主人下马客在船，举酒欲饮无管弦。醉不成欢惨将别，......",  // 琵琶行 白居易
    "黄埃散漫风萧索，云栈萦纡登剑阁。峨嵋山下少人行，旌旗无光日色薄。蜀江水碧蜀山青，......"   // 长恨歌 白居易
};

const QVector<QString> LevelOriginAndAutor::origins = {
    "《短歌行》", "《劝学》", "《一剪梅▪游蒋山呈叶丞相》", "《赤壁赋》", "《春江花月夜》",
    "《鹧鸪天▪桂花》", "《沁园春▪雪》", "《清平调▪其一》", "《鹊桥仙▪纤云弄巧》", "《与妻书》",
    "《燕歌行》", "《蜀道难》", "《五石之瓠》", "《阿房宫赋》", "《洛神赋》",
    "《诗经▪蒹葭》", "《岳阳楼记》", "《左传▪襄公二十四年》", "《琵琶行》", "《长恨歌》"
};

const QVector<QString> LevelOriginAndAutor::autors = {
    "曹操", "荀子", "辛弃疾", "苏轼", "张若虚",
    "李清照", "毛泽东", "李白", "秦观", "林觉民",
    "高适", "李白", "庄子", "杜牧", "曹植",
    "", "范仲淹", "", "白居易", "白居易"
};

QString LevelOriginAndAutor::getTargetText(int index) {
    return targetText.value(index, QString());
}

QString LevelOriginAndAutor::getOrigin(int index) {
    return origins.value(index, QString());
}

QString LevelOriginAndAutor::getAutor(int index) {
    return autors.value(index, QString());
}
